content/posts/motivation-and-blog-content-focus.md
+++
title = "Motivation and Blog Content Focus"
author = ["Rodrigo Machuca"]
description = "org-mode markup content to be parsed and rendered into CommonMarkdown by ox-hugo"
date = 2020-09-04T21:46:00-05:00
draft = false
+++

Howdy! you curious, smart and inquisitive internaut. This is my first post to
discuss my personal motivation on creating this space for you and me.

But first of all, **who am I** and why you should spend your valuable time surfing
through my content? I am just another geeky regular joe that enjoys tinkering
with new technologies and sharing it with the communities that has given me a
lot with no expected retribution or deferred payments. I am talking about the
_Linux and Free Open Source Software (FOSS)_ movements. For a more thorough view
of my personal interests and trajectory, please refer to [my About](https://www.rmachuca.me/about) section.

**What took me so long?** I had this personal project pending under my backlog of
wish lists and dream-line for a long time that I kept procrastinating. But times
have changed, COVID-19 is here to stay for a while, and so working from home
(WFH), which in turn has given me an unique opportunity of reclaiming that
scarce commute time back to work-out, learn, be with my lovely wife and of
course, play some video games.

**Why?** It is time to give back to the same communities that helped me grow,
learn and continue improving in my career. In addition, personally I want to
refine my communications skills (English, writing) and what better way than
jumping into the unknown of this bast cyberspace. Finally, I intend to use also
this resource for personal technical reference.

## Focus {#focus}

I will be focusing in the beginning on the following areas or technologies:

Text Editing and Writing
: emacs, doom-emacs, org-mode, hugo

Web Technologies
: HTML, CSS, Browsers, APIs (REST, GraphQL, Protobuf)

Programming
: Python, JavaScript, Go

Infrastructure
: Cloud (AWS, GCP), Networking

DevOps and SRE Practices
: Monitoring, CI/CD, Automation and Integration

If time and motivation keeps going, I will expand the content to Spanish (my
native language) once I learn about [Hugo internationalization (i18n)](https://gohugo.io/content-management/multilingual/).
